{
  "plugins": {
    "FixCursorHold.nvim": {
      "src": "git@github.com:antoinemadec/FixCursorHold.nvim"
    },
    "actions-preview.nvim": {
      "src": "git@github.com:aznhe21/actions-preview.nvim"
    },
    "blame.nvim": {
      "src": "git@github.com:FabijanZulj/blame.nvim"
    },
    "gitsigns.nvim": {
      "src": "git@github.com:lewis6991/gitsigns.nvim"
    },
    "indent-blankline.nvim": {
      "src": "git@github.com:lukas-reineke/indent-blankline.nvim"
    },
    "lualine.nvim": {
      "src": "git@github.com:nvim-lualine/lualine.nvim"
    },
    "marks.nvim": {
      "src": "git@github.com:chentoast/marks.nvim"
    },
    "mason-tool-installer.nvim": {
      "src": "git@github.com:WhoIsSethDaniel/mason-tool-installer.nvim"
    },
    "mason.nvim": {
      "src": "git@github.com:williamboman/mason.nvim"
    },
    "mini.indentscope": {
      "src": "git@github.com:echasnovski/mini.indentscope"
    },
    "neotest": {
      "src": "git@github.com:nvim-neotest/neotest"
    },
    "neotest-dotnet": {
      "src": "git@github.com:Issafalcon/neotest-dotnet"
    },
    "neotest-go": {
      "src": "git@github.com:nvim-neotest/neotest-go"
    },
    "neotest-gtest": {
      "src": "git@github.com:alfaix/neotest-gtest"
    },
    "neotest-jdtls": {
      "src": "git@github.com:fabrizioperria/neotest-jdtls"
    },
    "neotest-python": {
      "src": "git@github.com:nvim-neotest/neotest-python"
    },
    "netcoredbg-macOS-arm64.nvim": {
      "src": "git@github.com:Cliffback/netcoredbg-macOS-arm64.nvim"
    },
    "nvim-colorizer.lua": {
      "src": "git@github.com:catgoose/nvim-colorizer.lua"
    },
    "nvim-dap": {
      "src": "git@github.com:mfussenegger/nvim-dap"
    },
    "nvim-dap-go": {
      "src": "git@github.com:leoluz/nvim-dap-go"
    },
    "nvim-dap-python": {
      "src": "git@github.com:mfussenegger/nvim-dap-python"
    },
    "nvim-dap-ui": {
      "src": "git@github.com:rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": {
      "src": "git@github.com:theHamsta/nvim-dap-virtual-text"
    },
    "nvim-jdtls": {
      "src": "git@github.com:mfussenegger/nvim-jdtls"
    },
    "nvim-lspconfig": {
      "src": "git@github.com:neovim/nvim-lspconfig"
    },
    "nvim-nio": {
      "src": "git@github.com:nvim-neotest/nvim-nio"
    },
    "nvim-surround": {
      "src": "git@github.com:kylechui/nvim-surround"
    },
    "nvim-treesitter": {
      "src": "git@github.com:nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-treesitter-textobjects": {
      "src": "git@github.com:nvim-treesitter/nvim-treesitter-textobjects"
    },
    "nvim-web-devicons": {
      "src": "git@github.com:nvim-tree/nvim-web-devicons"
    },
    "plenary.nvim": {
      "src": "git@github.com:nvim-lua/plenary.nvim"
    },
    "powershell.nvim": {
      "src": "git@github.com:TheLeoP/powershell.nvim"
    },
    "roslyn.nvim": {
      "src": "git@github.com:seblyng/roslyn.nvim"
    },
    "telescope-dap.nvim": {
      "src": "git@github.com:nvim-telescope/telescope-dap.nvim"
    },
    "telescope-file-browser.nvim": {
      "src": "git@github.com:nvim-telescope/telescope-file-browser.nvim"
    },
    "telescope-fzf-native.nvim": {
      "src": "git@github.com:nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope-live-grep-args.nvim": {
      "src": "git@github.com:nvim-telescope/telescope-live-grep-args.nvim"
    },
    "telescope-project.nvim": {
      "src": "git@github.com:nvim-telescope/telescope-project.nvim"
    },
    "telescope-ui-select.nvim": {
      "src": "git@github.com:nvim-telescope/telescope-ui-select.nvim"
    },
    "telescope-undo.nvim": {
      "src": "git@github.com:debugloop/telescope-undo.nvim"
    },
    "telescope.nvim": {
      "src": "git@github.com:nvim-telescope/telescope.nvim"
    },
    "tokyonight.nvim": {
      "src": "git@github.com:folke/tokyonight.nvim"
    },
    "ts-comments.nvim": {
      "src": "git@github.com:folke/ts-comments.nvim"
    },
    "vim-tmux-navigator": {
      "src": "git@github.com:christoomey/vim-tmux-navigator"
    },
    "which-key.nvim": {
      "src": "git@github.com:folke/which-key.nvim"
    },
    "zig.vim": {
      "src": "https://codeberg.org/ziglang/zig.vim"
    }
  }
}
